"use client"

import tableBg from '@/assets/images/tableBg.svg'


const TableArea = () => {

    const columns =  ["구분", "時", "日", "月", "年"]
    const data = [
            {
                "구분": "十星",
                "時": "傷官(상관)",
                "日": "比肩(비견)",
                "月": "傷官(상관)",
                "年": "傷官(상관)"
            },
            {
                "구분": "천간",
                "時": "壬(임수 陽水)",
                "日": "丁(정화 陰火)",
                "月": "癸(계수 陰水)",
                "年": "癸(계수 陰水)"
            },
            {
                "구분": "지지",
                "時": "寅(인목 陽木)",
                "日": "巳(사화 陰火)",
                "月": "亥(해수 陰水)",
                "年": "酉(유금 陰金)"
            },
            {
                "구분": "십성",
                "時": "比肩(비견)",
                "日": "劫財(겁재)",
                "月": "食神(식신)",
                "年": "偏財(편재)"
            },
            {
                "구분": "십이운성",
                "時": "死(사)",
                "日": "帝旺(제왕)",
                "月": "胎(태)",
                "年": "長生(장생)"
            },
            {
                "구분": "십이신살",
                "時": "劫殺(겁살)",
                "日": "地殺(지살)",
                "月": "驛馬殺(역마살)",
                "年": "將星殺(장성살)"
            },
            {
                "구분": "귀인",
                "時": "없음",
                "日": "없음",
                "月": "天乙(천을귀인)",
                "年": "天乙(천을귀인), 太極(태극귀인), 文昌(문창귀인)"
            }
        ]


    return     <div
        className="w-full h-full bg-contain bg-no-repeat "
        style={{ backgroundImage: `url(${tableBg.src})` }}
    >
        <div className="text-white p-4">내용</div>
    </div>
}

export default TableArea
